[
    {
        "task_name": "Provide detailed information about robot specifications, features, and capabilities",
        "steps": [
            "Acknowledge the user's request for detailed information about robot specifications, features, and capabilities using MessageWorker.",
            "Utilize FaissRAGWorker to access and retrieve relevant information from the company's internal documentation about robot specifications, features, and capabilities.",
            "Deliver the retrieved information to the user through MessageWorker.",
            "Ask the user if they need further clarification or additional information regarding the robots.",
            "Based on the user's response, either provide more detailed information using FaissRAGWorker and MessageWorker or conclude the interaction if the user is satisfied."
        ]
    },
    {
        "task_name": "Assist with order tracking, delivery times, and logistics information",
        "steps": [
            "Use MessageWorker to greet the user and ask for their order number or details required to track their order.",
            "Use FaissRAGWorker to retrieve information about the order tracking, delivery times, and logistics based on the provided order details from the company's internal documentation.",
            "Use MessageWorker to deliver the retrieved tracking and delivery information to the user, including the current status and estimated delivery time.",
            "Ask the user if they need further assistance with their order or have any other questions regarding the delivery or logistics.",
            "If the user has additional questions, use FaissRAGWorker to gather the relevant information and use MessageWorker to provide the answers. Otherwise, thank the user and close the interaction."
        ]
    },
    {
        "task_name": "Offer technical assistance and troubleshooting for robot operation and maintenance",
        "steps": [
            "Ask the user to describe the technical issue or assistance needed for robot operation and maintenance.",
            "Use FaissRAGWorker to search the company's internal documentation for relevant solutions or troubleshooting steps based on the user's description.",
            "Deliver the suggested solutions or troubleshooting steps to the user using MessageWorker.",
            "Ask the user if the provided solution resolved their issue or if they need further assistance.",
            "If the issue is resolved, confirm with the user and offer further assistance for other queries. If the issue is not resolved, ask for additional details and repeat the troubleshooting process."
        ]
    },
    {
        "task_name": "Provide information on purchasing options, rental agreements, and pricing",
        "steps": [
            "Inquire about the specific purchasing options, rental agreements, or pricing information the user is interested in.",
            "Use FaissRAGWorker to search and retrieve relevant information from the company's internal documentation based on the user's query.",
            "Deliver the retrieved information to the user using MessageWorker, ensuring clarity and completeness.",
            "Ask the user if they need further clarification or additional information on other topics.",
            "Provide instructions or next steps based on the user's follow-up questions or confirm that their query has been resolved."
        ]
    },
    {
        "task_name": "Schedule maintenance, repairs, and provide service agreement information",
        "steps": [
            "Ask the user for details about their maintenance or repair needs, including any specific issues they are experiencing or services they require.",
            "Use the FaissRAGWorker to retrieve information about available maintenance and repair services, as well as service agreement details, from the company's internal documentation.",
            "Provide the user with the relevant information about the services available and any related service agreement terms using the MessageWorker.",
            "Ask the user if they would like to schedule a maintenance or repair service based on the information provided.",
            "If the user wants to schedule a service, confirm the details such as date, time, and location, and provide confirmation of the scheduled service."
        ]
    },
    {
        "task_name": "Facilitate the filing of complaints and collection of customer feedback",
        "steps": [
            "Initiate the conversation by asking the user if they would like to file a complaint or provide feedback.",
            "If the user wants to file a complaint, ask for specific details about the issue they are experiencing.",
            "Use FaissRAGWorker to provide any relevant information from the company's internal documentation regarding the issue raised.",
            "Request any additional information needed to complete the complaint filing process.",
            "Confirm the details provided by the user and inform them of the next steps in the complaint resolution process.",
            "If the user wants to provide feedback, inquire if it's regarding a specific product, service, or general experience.",
            "Gather detailed feedback by asking open-ended questions, ensuring the user feels heard and valued.",
            "Thank the user for their feedback and inform them how their input will be used to improve the service or product."
        ]
    },
    {
        "task_name": "Explore partnership opportunities and custom solutions with businesses and organizations",
        "steps": [
            "Inquire about the organization's specific needs or interests regarding partnership opportunities or custom solutions.",
            "Utilize the FaissRAGWorker to retrieve relevant information from the company's internal documentation that addresses the user's inquiry.",
            "Provide the retrieved information to the user and ask if they have any further questions or require additional details.",
            "Ask if the user would like to proceed with exploring a potential partnership, need a custom solution, or require direct contact with a sales representative.",
            "Facilitate the next steps based on the user's decision, such as setting up a meeting with a representative or providing additional resources for further exploration."
        ]
    }
]